[
    {
      "id": 1,
      "name": "Turbocharger",
      "image": "/assets/turbo.png",
      "partset1": [
        {
          "name" : "CamShaft",
          "image": "/assets/engineParts/camshaft.png"
        },
        {
          "name" : "CrankShaft",
          "image": "/assets/engineParts/crankshaft.png"
        },
        {
          "name" : "Connecting Rods",
          "image": "/assets/engineParts/connectingRods.png"
        },
        {
          "name" : "Pistons",
          "image": "/assets/engineParts/pistons.png"
        },
        {
          "name" : "Spark Plugs",
          "image": "/assets/engineParts/plugs.png"
        },
        {
          "name" : "Engine Block",
          "image": "/assets/engineParts/engineBlock.png"
        },
        {
          "name" : "Cylinder Head",
          "image": "/assets/engineParts/headCylinder.png"
        }


            ],
      "detailset1": [
        {
          "topic": "What is the Turbocharger",
          "Description": "A turbocharger is a forced induction system that significantly enhances an engine’s power and efficiency by compressing air entering the combustion chamber. Composed of a turbine and a compressor linked by a shared shaft, it operates by harnessing wasted exhaust gases to spin the turbine. This rotational energy drives the compressor, which pressurizes ambient air, increasing its density before injecting it into the engine. By delivering more oxygen-rich air, the engine can burn fuel more completely and aggressively, generating greater horsepower without requiring a larger displacement. Modern turbochargers often include advanced features like intercoolers (to cool compressed air for better density), variable geometry turbines (to optimize airflow at different RPMs), and lightweight materials for reduced lag. Originally developed for aircraft engines in the early 20th century, turbos are now ubiquitous in automotive engineering, enabling smaller engines to rival the output of larger ones while improving fuel economy and reducing emissions."
        },
        {
          "topic": "How Does it Work",
          "Description": "The turbocharger operates through a four-stage process: exhaust gas redirection, turbine activation, air compression, and combustion enhancement. First, exhaust gases expelled from the engine are funneled through the turbo’s turbine housing, causing the turbine wheel to spin at speeds exceeding 150,000 RPM. This spinning motion transfers energy to the compressor wheel on the opposite end of the shaft. The compressor draws in ambient air, pressurizes it, and forces it into the engine’s intake manifold. However, compressed air heats up during this process, reducing its density. To counteract this, an intercooler cools the air before it enters the combustion chamber, maximizing oxygen content. The denser air allows the engine to inject more fuel, creating a more powerful explosion in the cylinders. This cycle is managed by a wastegate, which regulates boost pressure to prevent engine damage. While turbochargers historically suffered from 'turbo lag' (a delay in power delivery), modern designs use twin-scroll housings, ball bearings, and electric assist systems to minimize this drawback, delivering near-instantaneous throttle response."
        },
        {
          "topic": "Common in Performance Cars",
          "Description": "Turbochargers are a cornerstone of high-performance automotive engineering, particularly in sports cars, supercars, and rally vehicles. Brands like Porsche, Audi, and Ferrari use turbocharged engines to achieve extraordinary power-to-weight ratios. For example, the Porsche 911 Turbo S generates 640 horsepower from a 3.8L twin-turbo flat-six engine, rivaling the output of naturally aspirated V12 engines at half the displacement. Turbos are also critical in motorsports; Formula 1’s hybrid-era V6 engines rely on turbocharging paired with energy recovery systems for efficiency and power. Beyond raw performance, automakers use turbos to meet strict emissions regulations. By downsizing engines (e.g., replacing a V8 with a turbocharged V6), manufacturers reduce weight and fuel consumption while maintaining power. Even mainstream brands like Hyundai and Ford now turbocharge smaller engines (e.g., 1.6L or 2.0L) to replace older, less efficient larger engines. In diesel trucks, turbos provide the low-end torque needed for towing and hauling, making them indispensable in commercial and off-road applications."
        }
      ],
      "shadow": "/assets/turboShadow.png",
      "description": "A turbocharger increases the engine's efficiency and power by forcing more air into the combustion chamber. Turbochargers are a key performance-enhancing component in modern engines. By increasing the amount of air entering the engine, a turbo enables a higher combustion rate, improving power output without increasing engine size. This allows manufacturers to create smaller, more efficient engines that produce the same or even higher performance than larger, naturally aspirated counterparts. Turbos also help reduce emissions and improve fuel economy. They are commonly found in sports cars, high-performance vehicles, and commercial trucks, where they provide the necessary power and torque for both speed and load-bearing capabilities.",
      "details": [
        "Improves engine power",
        "Increases fuel efficiency",
        "Common in performance cars"
      ]
    },
    {
      "id": 2,
      "name": "Engine",
      "image": "/assets/engine.png",
      "shadow": "/assets/engineShadow.png",
      "description": "The engine is the heart of a vehicle...",
      "subTopic1" : "engine",
      "subTopic2" : "Torque | Displacement | Compression Ratio | Fuel Consumption",
      "subSection": [

        {
          "subName1": "Torque",
          "subImage1": "/assets/engines/subset/sub1.png"
        },
        {
         "subName1": "Displacement",
         "subImage1": "/assets/engines/subset/sub2.png"
        },
       {
       "subName1": "Compression Ratio",
       "subImage1": "/assets/engines/subset/sub3.png"
       },
       {
       "subName1": "Fuel Consumption",
       "subImage1": "/assets/engines/subset/sub4.png"
        }

          ],
      "partset1": [
          {
            "name": "Camshaft",
            "image": "/assets/engineParts/camshaft.png",
            "description": "The camshaft is responsible for controlling the timing of the intake and exhaust valves, ensuring optimal engine performance and efficiency."
          },
          {
            "name": "Crankshaft",
            "image": "/assets/engineParts/crankshaft.png",
            "description": "The crankshaft converts the reciprocating motion of the pistons into rotational motion, which drives the vehicle's wheels."
          },
          {
            "name": "Connecting Rods",
            "image": "/assets/engineParts/connectingRods.png",
            "description": "Connecting rods link the pistons to the crankshaft, transmitting the force generated by combustion to create rotational power."
          },
          {
            "name": "Pistons",
            "image": "/assets/engineParts/pistons.png",
            "description": "Pistons move up and down inside the cylinders, compressing the air-fuel mixture and transferring energy from combustion to the crankshaft."
          },
          {
            "name": "Spark Plugs",
            "image": "/assets/engineParts/plugs.png",
            "description": "Spark plugs generate the spark needed to ignite the air-fuel mixture in the combustion chamber, powering the engine."
          },
          {
            "name": "Engine Block",
            "image": "/assets/engineParts/engineBlock.png",
            "description": "The engine block is the main structure of the engine, housing cylinders, pistons, and other crucial components."
          },
          {
            "name": "Cylinder Head",
            "image": "/assets/engineParts/headCylinder.png",
            "description": "The cylinder head sits atop the engine block and contains the intake and exhaust valves, spark plugs, and fuel injectors."
          }
        ],
      "variations" : [

        {
            "name": "V2",
            "image": "/assets/engines/v2.png",
            "sound": "/assets/records/v8Sound.mp3"

        },
        {
            "name": "V6",
            "image": "/assets/engines/v6.png",
            "sound": "/assets/records/v8Sound.mp3"
        },
        {
            "name": "V8",
            "image": "/assets/engines/v8.png",
            "sound": "/assets/records/v8Sound.mp3"
        },
        {
            "name": "V10",
            "image": "/assets/engines/v10.png",
            "sound": "/assets/records/v8Sound.mp3"
        },
        {
            "name": "V12",
            "image": "/assets/engines/v12.png",
            "sound": "/assets/records/v8Sound.mp3"
        },
        {
          "name": "W12",
          "image": "/assets/engines/w12.png",
          "sound": "/assets/records/v8Sound.mp3"
        },
        {
          "name": "W16",
          "image": "/assets/engines/w16.png"
       }

      ],
      "maindetailset1": {

          "topic": "The Evolution of Engines",
          "Description": "The evolution of engines is a fascinating journey that spans centuries, marked by groundbreaking innovations and technological advancements. Engines, which convert various forms of energy into mechanical work, have played a pivotal role in shaping modern civilization. From the early steam engines to the sophisticated internal combustion engines and the emerging electric propulsion systems, the development of engines has been driven by the need for efficiency, power, and sustainability."

      },
      "detailset1": [
        {
          "topic": "The Steam Engine: The Dawn of the Industrial Revolution",
          "Description": "The story of engine evolution begins with the invention of the steam engine in the 18th century. Thomas Newcomen's atmospheric engine, developed in 1712, was one of the first practical steam engines used to pump water out of mines. However, it was James Watt's improvements in the late 18th century that truly revolutionized the steam engine. Watt's addition of a separate condenser significantly increased efficiency, making steam engines viable for a wide range of industrial applications.Steam engines became the backbone of the Industrial Revolution, powering factories, locomotives, and ships. They enabled mass production, transformed transportation, and facilitated the growth of cities. Despite their success, steam engines were bulky, required significant maintenance, and had limited efficiency, prompting the search for more advanced technologies."
        },
        {
          "topic": "The Internal Combustion Engine: A New Era of Mobility",
          "Description": "The late 19th and early 20th centuries marked a pivotal period in the history of technology with the rise of the internal combustion engine (ICE). This revolutionary invention became the dominant engine technology for over a century, fundamentally transforming transportation, industry, and daily life. Unlike earlier engines, such as the steam engine, which relied on external combustion, the ICE operates by burning fuel directly within a combustion chamber. This process generates high-pressure gases that drive pistons or turbines, converting chemical energy into mechanical work with remarkable efficiency.The ICE's ability to provide compact, powerful, and reliable energy sources made it the cornerstone of modern industrialization. It enabled the development of automobiles, airplanes, and a wide range of machinery, reshaping economies and societies worldwide. However, its widespread adoption also brought challenges, particularly regarding environmental impact and reliance on fossil fuels. Below, we explore the key milestones in the development of the ICE, its transformative impact, and the challenges it has faced"
        },
        {
          "topic": "The Jet Engine: Propelling Aviation to New Heights",
          "Description": "The mid-20th century witnessed the advent of the jet engine, which transformed aviation. Sir Frank Whittle and Hans von Ohain independently developed the first operational jet engines in the 1930s and 1940s. Jet engines work by compressing air, mixing it with fuel, and igniting it to produce a high-speed exhaust jet that generates thrust.Jet engines enabled faster, higher, and longer flights, making air travel accessible to the masses. They also powered military aircraft, leading to advancements in aerospace technology. Over time, jet engines have become more efficient, quieter, and environmentally friendly, with ongoing research focused on reducing emissions and fuel consumption."
        }
      ],
      "maindetailset2": {

        "topic": "The Diverse World of Engines",
        "Description": "Engines have evolved from traditional combustion-based systems to cutting-edge clean energy technologies, each with unique advantages and challenges. From the quiet efficiency of Stirling engines and the compact design of Wankel rotary engines to the zero-emission potential of electric propulsion and hydrogen fuel cells, this exploration covers the full spectrum of engine technologies. It also delves into hybrid systems, the immense power of rocket engines, and the versatility of turbine engines, highlighting their roles in shaping transportation, industry, and space exploration. Together, these innovations reflect humanity’s quest for efficiency, sustainability, and progress in power generation."

    },
    "detailset2": [
      {
        "topic": "The Stirling Engine: An Alternative Approach",
        "Description": "The Stirling engine, invented by Robert Stirling in 1816, is an external combustion engine that operates by cyclically compressing and expanding a working gas (such as air or helium) at different temperatures. Unlike internal combustion engines, which burn fuel inside the engine, the Stirling engine uses an external heat source, making it highly versatile. It works on the principle of temperature differentials, where heat is applied to one end of the engine and removed from the other, creating a cycle of expansion and contraction that drives a piston or rotor.",
        "image": "/assets/engines/w12.png",
        "Advantages":"High Efficiency: Stirling engines can achieve high thermal efficiency, especially when paired with renewable heat sources like solar energy.Low Noise: Since combustion occurs externally, Stirling engines operate quietly compared to internal combustion engines.Versatility: They can use almost any heat source, including solar, nuclear, or waste heat from industrial processes.",
        "Issues":"Slow Response Time: Stirling engines are not well-suited for applications requiring rapid changes in power output, as they take time to adjust to temperature changes.Complexity and Cost: The need for precise engineering to maintain gas seals and manage heat transfer makes Stirling engines expensive to manufacture and maintain.Low Power-to-Weight Ratio: They are generally bulkier and heavier than internal combustion engines, limiting their use in mobile applications."

      },
      {
        "topic": "The Wankel Rotary Engine: A Unique Design",
        "Description": "The Wankel rotary engine, developed by Felix Wankel in the 1950s, is an internal combustion engine that uses a triangular rotor instead of reciprocating pistons. The rotor spins in an epitrochoidal chamber, creating three combustion spaces that undergo intake, compression, combustion, and exhaust cycles in a single rotation. This design allows for smooth and continuous power delivery.",
        "image": "/assets/engines/w12.png",
        "Advantages":"Compact Size: The Wankel engine is smaller and lighter than traditional piston engines, making it ideal for applications where space is limited.High Power-to-Weight Ratio: Its design allows for high power output relative to its size.Smooth Operation: The absence of reciprocating parts reduces vibration and noise.",
        "Issues":"Fuel Efficiency and Emissions: Wankel engines tend to consume more fuel and produce higher emissions compared to piston engines, due to incomplete combustion and sealing challenges.Sealing Problems: Maintaining a tight seal between the rotor and the chamber is difficult, leading to wear and reduced durability over time.Limited Market Adoption: Despite its advantages, the Wankel engine has seen limited use, primarily in niche applications like Mazda’s RX series of sports cars."

      },
      {
        "topic": "Hybrid Engines: Combining the Best of Both Worlds",
        "Description": "Hybrid engines combine an internal combustion engine (ICE) with an electric propulsion system to improve efficiency and reduce emissions. They can operate in multiple modes, including electric-only, engine-only, or a combination of both, depending on driving conditions.",
        "image": "/assets/engines/w12.png",
        "Advantages":"Improved Fuel Efficiency: Hybrids use regenerative braking and electric power to reduce fuel consumption.Reduced Emissions: By relying on electric power for low-speed driving, hybrids produce fewer emissions.Extended Range: The ICE provides backup power, eliminating range anxiety associated with pure electric vehicle",
        "Issues":"Complexity: Hybrid systems are more complex than traditional engines, requiring advanced control systems and software.Higher Cost: The additional components and technology make hybrids more expensive to produce and purchase.Battery Limitations: Like electric vehicles, hybrids rely on batteries, which have environmental and durability concerns."

      }
    ]
    },
    {
      "id": 3,
      "name": "Suspension",
      "image": "/assets/suspension.png",
      "shadow": "/assets/suspensionShadow.png",
      "description": "Suspension systems are responsible for...",
      "partset1": [
        {
          "name" : "CamShaft",
          "image": "/assets/engineParts/camshaft.png"
        },
        {
          "name" : "CrankShaft",
          "image": "/assets/engineParts/crankshaft.png"
        },
        {
          "name" : "Connecting Rods",
          "image": "/assets/engineParts/connectingRods.png"
        },
        {
          "name" : "Pistons",
          "image": "/assets/engineParts/pistons.png"
        },
        {
          "name" : "Spark Plugs",
          "image": "/assets/engineParts/plugs.png"
        },
        {
          "name" : "Engine Block",
          "image": "/assets/engineParts/engineBlock.png"
        },
        {
          "name" : "Cylinder Head",
          "image": "/assets/engineParts/headCylinder.png"
        }


            ],
      "detailset1": [
        {
          "topic": "Suspension Engineering Fundamentals",
          "Description": "Suspension geometry (camber, caster, toe) dictates tire contact and stability. MacPherson struts (common in front-wheel drives) combine shock/spring into a compact unit, while multi-link designs (Mercedes E-Class) enable precise wheel control. Spring rates (measured in lbs/in) and damping coefficients determine ride stiffness—sports cars use 400+ lbs/in springs vs. 150 lbs/in in sedans. Anti-roll bars reduce body lean by 30-50% during cornering, enhancing driver confidence."
        },
        {
          "topic": "Advanced Suspension Technologies",
          "Description": "Adaptive dampers (GM’s MagneRide) use magnetorheological fluid to adjust firmness in 1ms. Air suspension (Audi A8) auto-levels the vehicle and lowers at speed for aerodynamics. Active rear steering (Porsche 911 GT3) turns rear wheels up to 5° for tighter turns. Track-focused systems like Ferrari’s SCM-E integrate accelerometers and GPS to predict road surfaces, optimizing damping in real time."
        },
        {
          "topic": "Application-Specific Designs",
          "Description": "Off-road suspensions (Jeep Wrangler) prioritize articulation (20+ inches) via solid axles and long-travel shocks. Luxury cars (Lexus LS) employ frequency-reactive dampers to isolate cabin from road noise. Motorsport suspensions use pushrod/pullrod layouts (F1 cars) to lower centers of gravity. Autonomous vehicles require tunable suspensions to compensate for sensor latency during evasive maneuvers."
        }
      ]
    },
    {
      "id": 4,
      "name": "Cooler",
      "image": "/assets/cooler.png",
      "shadow": "/assets/coolerShadow.png",
      "description": "Coolers help regulate engine temperatures...",
      "partset1": [
        {
          "name" : "CamShaft",
          "image": "/assets/engineParts/camshaft.png"
        },
        {
          "name" : "CrankShaft",
          "image": "/assets/engineParts/crankshaft.png"
        },
        {
          "name" : "Connecting Rods",
          "image": "/assets/engineParts/connectingRods.png"
        },
        {
          "name" : "Pistons",
          "image": "/assets/engineParts/pistons.png"
        },
        {
          "name" : "Spark Plugs",
          "image": "/assets/engineParts/plugs.png"
        },
        {
          "name" : "Engine Block",
          "image": "/assets/engineParts/engineBlock.png"
        },
        {
          "name" : "Cylinder Head",
          "image": "/assets/engineParts/headCylinder.png"
        }


            ],
      "detailset1": [
        {
          "topic": "Thermodynamics of Cooling Systems",
          "Description": "Cooling systems manage 30-40% of engine heat via convection and conduction. Radiators use aluminum cores (95% conductivity) with 100+ microtubes to maximize surface area. Coolant mixtures (50% ethylene glycol) raise boiling points to 265°F and prevent freezing. Oil coolers maintain viscosity by stabilizing temps between 190-220°F—critical for turbocharged engines (e.g., Subaru WRX) where oil degrades rapidly under high thermal loads."
        },
        {
          "topic": "High-Performance Cooling Solutions",
          "Description": "Track cars employ dual-pass radiators with 30% greater flow rates. Auxiliary oil coolers (BMW M3) add 2-3 quarts of capacity. Intercoolers (Volvo’s Charge Air Cooler) reduce intake temps by 100°F, increasing air density for combustion. Liquid-to-air systems (Ford GT) cool both transmission and differential fluids via shared heat exchangers. Formula 1 cars use 10-layer carbon fiber oil tanks with integrated cooling fins."
        },
        {
          "topic": "Failure Prevention & Diagnostics",
          "Description": "Common failures: corroded cores (pH imbalance), cracked tanks (vibration stress), or clogged passages (contaminated coolant). Infrared thermography identifies hotspots, while pressure tests (15 psi) detect leaks. Preventative measures include biannual coolant flushes and additive packages (Water Wetter) to enhance heat transfer."
        }
      ]
    },
    {
      "id": 5,
      "name": "Brake",
      "image": "/assets/brake.png",
      "shadow": "/assets/brakeShadow.png",
      "description": "Brakes are essential for slowing down...",
      "partset1": [
        {
          "name" : "CamShaft",
          "image": "/assets/engineParts/camshaft.png"
        },
        {
          "name" : "CrankShaft",
          "image": "/assets/engineParts/crankshaft.png"
        },
        {
          "name" : "Connecting Rods",
          "image": "/assets/engineParts/connectingRods.png"
        },
        {
          "name" : "Pistons",
          "image": "/assets/engineParts/pistons.png"
        },
        {
          "name" : "Spark Plugs",
          "image": "/assets/engineParts/plugs.png"
        },
        {
          "name" : "Engine Block",
          "image": "/assets/engineParts/engineBlock.png"
        },
        {
          "name" : "Cylinder Head",
          "image": "/assets/engineParts/headCylinder.png"
        }


            ],
      "detailset1": [
        {
          "topic": "Braking System Mechanics",
          "Description": "Hydraulic systems amplify pedal force (6:1 ratio) via master cylinders. Disc brakes (Brembo 4-piston calipers) provide 20% better fade resistance than drums. Ceramic pads (Akebono PRO-ACT) reduce dust and noise, while carbon-ceramic rotors (Porsche PCCB) withstand 1,800°F temps but cost $15k+/set. Regenerative braking (Tesla Model 3) recaptures 70% of kinetic energy, extending EV range by 10-15%."
        },
        {
          "topic": "Safety & Innovation",
          "Description": "ABS modulates brake pressure 15 times/sec to prevent lockup. Electronic brakeforce distribution (EBD) balances front/rear bias dynamically. Autonomous emergency braking (AEB) uses radar/LiDAR to apply 1g deceleration if collisions are imminent. Future tech: brake-by-wire systems (Mercedes Sensotronic) replace hydraulic lines with electronic actuators for faster response."
        },
        {
          "topic": "High-Performance Braking Solutions",
          "Description": "Racing brakes use 6-piston monobloc calipers (AP Racing) and vented rotors with 1,200 drilled holes for heat dissipation. Air ducts (NASCAR) force-cool rotors during straights. Carbon-carbon brakes (F1) achieve 0.7g stopping power but require 500°F to function optimally. Drag racing utilizes parachutes for 200mph+ deceleration."
        }
      ]
    },
    {
      "id": 6,
      "name": "ECU",
      "image": "/assets/ecu.png",
      "shadow": "/assets/ecuShadow.png",
      "description": "The Engine Control Unit (ECU) is...",
      "partset1": [
        {
          "name" : "CamShaft",
          "image": "/assets/engineParts/camshaft.png"
        },
        {
          "name" : "CrankShaft",
          "image": "/assets/engineParts/crankshaft.png"
        },
        {
          "name" : "Connecting Rods",
          "image": "/assets/engineParts/connectingRods.png"
        },
        {
          "name" : "Pistons",
          "image": "/assets/engineParts/pistons.png"
        },
        {
          "name" : "Spark Plugs",
          "image": "/assets/engineParts/plugs.png"
        },
        {
          "name" : "Engine Block",
          "image": "/assets/engineParts/engineBlock.png"
        },
        {
          "name" : "Cylinder Head",
          "image": "/assets/engineParts/headCylinder.png"
        }


            ],
      "detailset1": [
        {
          "topic": "ECU Architecture & Functionality",
          "Description": "Modern ECUs (Bosch Motronic) use 32-bit microprocessors processing 250+ sensor inputs. Maps (fuel, ignition, boost) are stored in EEPROM chips. OBD-II protocols (CAN bus) enable real-time monitoring of parameters like AFR (14.7:1 stoichiometric) or knock sensor voltages. Flex-fuel ECUs (Ford EcoBoost) auto-adjust for E85 ethanol’s 30% lower energy density."
        },
        {
          "topic": "Performance Tuning & Calibration",
          "Description": "Stage 1 tunes (COBB Accessport) remap boost tables for +50HP while retaining OEM reliability. Dyno tuning (Mustang Dyno) customizes ignition advance curves for specific octane ratings. Anti-lag systems (rally cars) inject fuel into exhaust manifolds to maintain turbo spool between shifts. ECU cloning (BMW FEMTO) bypasses immobilizers for engine swaps."
        },
        {
          "topic": "Integration with Vehicle Systems",
          "Description": "ECUs network with TCU (transmission control) for rev-matching downshifts. Hybrid ECUs (Toyota Hybrid Synergy) manage power split between ICE and electric motors. Cybersecurity: Tesla’s ECU firmware uses SHA-256 encryption to prevent unauthorized tuning access."
        }
      ]
    }
  ]
  