[
    {
      "id": 1,
      "name": "Turbocharger",
      "image": "/assets/turbo.png",
      "shadow": "/assets/turboShadow.png",
      "description": "A turbocharger increases the engine's efficiency and power by forcing more air into the combustion chamber. Turbochargers are a key performance-enhancing component in modern engines. By increasing the amount of air entering the engine, a turbo enables a higher combustion rate, improving power output without increasing engine size. This allows manufacturers to create smaller, more efficient engines that produce the same or even higher performance than larger, naturally aspirated counterparts. Turbos also help reduce emissions and improve fuel economy. They are commonly found in sports cars, high-performance vehicles, and commercial trucks, where they provide the necessary power and torque for both speed and load-bearing capabilities.",
      "subTopic1" : "Turbo",
      "subTopic2" : "Turbo Boosting Measurements",
      "subSection": [
       {
       "subName1": "Turbo Bosting",
       "subImage1": "/assets/engines/subset/sub4.png"
        }

          ],
      "partset1": [
          {
            "name": "Center Housing",
            "image": "/assets/turboSystem/shell.png",
            "description": "The center housing is a critical component of the turbocharger, providing support and housing for the turbine and compressor wheels."
          },
          {
            "name": "Shell",
            "image": "/assets/turboSystem/shell2.png",
            "description": "The shell provides the outer casing for the turbocharger, protecting its internal components and ensuring proper airflow."
          },
          {
            "name": "Turbine",
            "image": "/assets/turboSystem/turbine.png",
            "description": "The turbine is a key component that harnesses exhaust gas energy to spin the compressor wheel, forcing more air into the engine and increasing power output."
          }
        ],
      "maindetailset1": {
        "topic": "The Evolution of Turbochargers",
        "Description": "Turbochargers have revolutionized engine performance by increasing power output and efficiency. Originally developed for aircraft engines in the early 20th century, turbochargers have become a staple in automotive and industrial applications. By forcing more air into the combustion chamber, turbochargers enable engines to burn more fuel and produce more power without increasing engine size. This technology has evolved significantly, with advancements in materials, design, and integration with hybrid and electric systems."
      },
      "detailset1": [
        {
          "topic": "Early Turbochargers: From Aircraft to Automobiles",
          "Description": "The first turbochargers were developed in the early 1900s to improve the performance of aircraft engines at high altitudes, where air density is lower. Swiss engineer Alfred Büchi patented the first practical turbocharger in 1905. By the 1920s, turbochargers were widely used in aviation, and by the 1960s, they began appearing in commercial vehicles and performance cars. Early turbo systems were prone to 'turbo lag' and reliability issues, but they laid the foundation for modern turbocharging technology."
        },
        {
          "topic": "Modern Turbochargers: Efficiency and Performance",
          "Description": "Modern turbochargers are highly efficient and reliable, thanks to advancements in materials like lightweight alloys and ceramics. Twin-scroll and variable geometry turbochargers have reduced turbo lag, while electronic controls optimize performance across a wide range of conditions. Turbochargers are now used in everything from small passenger cars to heavy-duty trucks, improving fuel efficiency and reducing emissions. Hybrid and electric turbochargers are also emerging, offering even greater efficiency and responsiveness."
        },
        {
          "topic": "Future of Turbocharging: Electric and Hybrid Systems",
          "Description": "The future of turbocharging lies in electric and hybrid systems. Electric turbochargers, powered by a small motor, eliminate turbo lag entirely and provide instant boost. Hybrid systems combine traditional turbochargers with electric assist, improving efficiency and performance. These innovations are particularly important as the automotive industry shifts toward electrification, ensuring that internal combustion engines remain competitive in a low-emission future."
        }
      ],
      "maindetailset2": {
        "topic": "The Latest Innovations in Turbocharger Technology",
        "Description": "Turbocharger technology continues to evolve, driven by the need for greater efficiency, reduced emissions, and improved performance. Recent advancements include electric turbochargers, advanced materials, and integration with hybrid and electric powertrains. These innovations are shaping the future of automotive and industrial engines, making turbochargers more versatile and environmentally friendly than ever before."
      },
      "detailset2": [
        {
          "topic": "Electric Turbochargers: Eliminating Turbo Lag",
          "Description": "Electric turbochargers, also known as e-turbos, are one of the most significant recent advancements in turbocharging technology. These systems use an electric motor to spin the turbocharger's compressor wheel, eliminating turbo lag and providing instant boost. Electric turbochargers are particularly beneficial in hybrid and performance vehicles, where rapid response and efficiency are critical. Companies like Garrett Motion and BorgWarner are leading the development of e-turbos, with applications in both passenger cars and commercial vehicles.",
          "image": null,
          "Advantages": "Instant Boost: Electric motors provide immediate power, eliminating turbo lag.Improved Efficiency: E-turbos can operate independently of exhaust gases, optimizing performance.Integration with Hybrid Systems: Electric turbochargers work seamlessly with hybrid powertrains, enhancing overall efficiency.",
          "Issues": "Cost: Electric turbochargers are more expensive to produce than traditional systems.Complexity: Integrating electric motors and control systems adds complexity to the design.Power Requirements: E-turbos require additional electrical power, which can strain vehicle electrical systems."
        },
        {
          "topic": "Variable Geometry Turbochargers (VGT): Precision and Flexibility",
          "Description": "Variable Geometry Turbochargers (VGTs) use adjustable vanes to control the flow of exhaust gases, optimizing performance across a wide range of engine speeds. This technology reduces turbo lag at low RPMs and improves efficiency at high RPMs. VGTs are widely used in diesel engines and are increasingly being adopted in gasoline engines. Recent advancements in materials and design have made VGTs more durable and cost-effective.",
          "image": null,
          "Advantages": "Reduced Turbo Lag: Adjustable vanes provide better low-end performance.Improved Efficiency: VGTs optimize exhaust gas flow, enhancing fuel economy.Versatility: Suitable for both diesel and gasoline engines.",
          "Issues": "Complexity: VGTs require precise control systems and durable materials.Cost: The additional components and engineering make VGTs more expensive.Maintenance: VGTs may require more frequent maintenance due to moving parts."
        },
        {
          "topic": "Turbochargers in Hybrid and Electric Vehicles",
          "Description": "Turbochargers are playing an increasingly important role in hybrid and electric vehicles. In hybrids, turbochargers improve the efficiency of internal combustion engines, while in electric vehicles, they can be used in range-extender applications. Recent developments include integrated turbo-generator systems that generate electricity from exhaust gases, further enhancing the efficiency of hybrid powertrains.",
          "image": null,
          "Advantages": "Enhanced Efficiency: Turbochargers improve the performance of hybrid engines.Range Extension: Turbo-generator systems can extend the range of electric vehicles.Reduced Emissions: Optimized combustion reduces greenhouse gas emissions.",
          "Issues": "Integration Challenges: Combining turbochargers with hybrid systems requires advanced engineering.Cost: Hybrid and electric turbo systems are more expensive to develop and produce.Weight: Additional components can increase vehicle weight, affecting efficiency."
        }
      ]
    },
    {
      "id": 2,
      "name": "Engine",
      "image": "/assets/engine.png",
      "shadow": "/assets/engineShadow.png",
      "description": "The engine is the heart of a vehicle...",
      "subTopic1" : "engine",
      "subTopic2" : "Torque | Displacement | Compression Ratio | Fuel Consumption",
      "subSection": [

        {
          "subName1": "Torque",
          "subImage1": "/assets/engines/subset/sub1.png"
        },
        {
         "subName1": "Displacement",
         "subImage1": "/assets/engines/subset/sub2.png"
        },
       {
       "subName1": "Compression Ratio",
       "subImage1": "/assets/engines/subset/sub3.png"
       },
       {
       "subName1": "Fuel Consumption",
       "subImage1": "/assets/engines/subset/sub4.png"
        }

          ],
      "partset1": [
          {
            "name": "Camshaft",
            "image": "/assets/engineParts/camshaft.png",
            "description": "The camshaft is responsible for controlling the timing of the intake and exhaust valves, ensuring optimal engine performance and efficiency."
          },
          {
            "name": "Crankshaft",
            "image": "/assets/engineParts/crankshaft.png",
            "description": "The crankshaft converts the reciprocating motion of the pistons into rotational motion, which drives the vehicle's wheels."
          },
          {
            "name": "Connecting Rods",
            "image": "/assets/engineParts/connectingRods.png",
            "description": "Connecting rods link the pistons to the crankshaft, transmitting the force generated by combustion to create rotational power."
          },
          {
            "name": "Pistons",
            "image": "/assets/engineParts/pistons.png",
            "description": "Pistons move up and down inside the cylinders, compressing the air-fuel mixture and transferring energy from combustion to the crankshaft."
          },
          {
            "name": "Spark Plugs",
            "image": "/assets/engineParts/plugs.png",
            "description": "Spark plugs generate the spark needed to ignite the air-fuel mixture in the combustion chamber, powering the engine."
          },
          {
            "name": "Engine Block",
            "image": "/assets/engineParts/engineBlock.png",
            "description": "The engine block is the main structure of the engine, housing cylinders, pistons, and other crucial components."
          },
          {
            "name": "Cylinder Head",
            "image": "/assets/engineParts/headCylinder.png",
            "description": "The cylinder head sits atop the engine block and contains the intake and exhaust valves, spark plugs, and fuel injectors."
          }
        ],
      "variations" : [

        {
            "name": "V2",
            "image": "/assets/engines/v2.png",
            "sound": "https://www.turboss.baoswheels.com/assets/records/v2.mp3"

        },
        {
            "name": "V6",
            "image": "/assets/engines/v6.png",
            "sound": "https://www.turboss.baoswheels.com/assets/records/v6.mp3"
        },
        {
            "name": "V8",
            "image": "/assets/engines/v8.png",
            "sound": "https://www.turboss.baoswheels.com/assets/records/v8.mp3"
        },
        {
            "name": "V10",
            "image": "/assets/engines/v10.png",
            "sound": "https://www.turboss.baoswheels.com/assets/records/v10.mp3"
        },
        {
            "name": "V12",
            "image": "/assets/engines/v12.png",
            "sound": "https://www.turboss.baoswheels.com/assets/records/v12.mp3"
        },
        {
          "name": "W12",
          "image": "/assets/engines/w12.png",
          "sound": "https://www.turboss.baoswheels.com/assets/records/w12.mp3"
        },
        {
          "name": "W16",
          "image": "/assets/engines/w16.png",
          "sound": "https://www.turboss.baoswheels.com/assets/records/w16.mp3"
       }

      ],
      "maindetailset1": {

          "topic": "The Evolution of Engines",
          "Description": "The evolution of engines is a fascinating journey that spans centuries, marked by groundbreaking innovations and technological advancements. Engines, which convert various forms of energy into mechanical work, have played a pivotal role in shaping modern civilization. From the early steam engines to the sophisticated internal combustion engines and the emerging electric propulsion systems, the development of engines has been driven by the need for efficiency, power, and sustainability."

      },
      "detailset1": [
        {
          "topic": "The Steam Engine: The Dawn of the Industrial Revolution",
          "Description": "The story of engine evolution begins with the invention of the steam engine in the 18th century. Thomas Newcomen's atmospheric engine, developed in 1712, was one of the first practical steam engines used to pump water out of mines. However, it was James Watt's improvements in the late 18th century that truly revolutionized the steam engine. Watt's addition of a separate condenser significantly increased efficiency, making steam engines viable for a wide range of industrial applications.Steam engines became the backbone of the Industrial Revolution, powering factories, locomotives, and ships. They enabled mass production, transformed transportation, and facilitated the growth of cities. Despite their success, steam engines were bulky, required significant maintenance, and had limited efficiency, prompting the search for more advanced technologies."
        },
        {
          "topic": "The Internal Combustion Engine: A New Era of Mobility",
          "Description": "The late 19th and early 20th centuries marked a pivotal period in the history of technology with the rise of the internal combustion engine (ICE). This revolutionary invention became the dominant engine technology for over a century, fundamentally transforming transportation, industry, and daily life. Unlike earlier engines, such as the steam engine, which relied on external combustion, the ICE operates by burning fuel directly within a combustion chamber. This process generates high-pressure gases that drive pistons or turbines, converting chemical energy into mechanical work with remarkable efficiency.The ICE's ability to provide compact, powerful, and reliable energy sources made it the cornerstone of modern industrialization. It enabled the development of automobiles, airplanes, and a wide range of machinery, reshaping economies and societies worldwide. However, its widespread adoption also brought challenges, particularly regarding environmental impact and reliance on fossil fuels. Below, we explore the key milestones in the development of the ICE, its transformative impact, and the challenges it has faced"
        },
        {
          "topic": "The Jet Engine: Propelling Aviation to New Heights",
          "Description": "The mid-20th century witnessed the advent of the jet engine, which transformed aviation. Sir Frank Whittle and Hans von Ohain independently developed the first operational jet engines in the 1930s and 1940s. Jet engines work by compressing air, mixing it with fuel, and igniting it to produce a high-speed exhaust jet that generates thrust.Jet engines enabled faster, higher, and longer flights, making air travel accessible to the masses. They also powered military aircraft, leading to advancements in aerospace technology. Over time, jet engines have become more efficient, quieter, and environmentally friendly, with ongoing research focused on reducing emissions and fuel consumption."
        }
      ],
      "maindetailset2": {

        "topic": "The Diverse World of Engines",
        "Description": "Engines have evolved from traditional combustion-based systems to cutting-edge clean energy technologies, each with unique advantages and challenges. From the quiet efficiency of Stirling engines and the compact design of Wankel rotary engines to the zero-emission potential of electric propulsion and hydrogen fuel cells, this exploration covers the full spectrum of engine technologies. It also delves into hybrid systems, the immense power of rocket engines, and the versatility of turbine engines, highlighting their roles in shaping transportation, industry, and space exploration. Together, these innovations reflect humanity’s quest for efficiency, sustainability, and progress in power generation."

    },
    "detailset2": [
      {
        "topic": "The Stirling Engine: An Alternative Approach",
        "Description": "The Stirling engine, invented by Robert Stirling in 1816, is an external combustion engine that operates by cyclically compressing and expanding a working gas (such as air or helium) at different temperatures. Unlike internal combustion engines, which burn fuel inside the engine, the Stirling engine uses an external heat source, making it highly versatile. It works on the principle of temperature differentials, where heat is applied to one end of the engine and removed from the other, creating a cycle of expansion and contraction that drives a piston or rotor.",
        "image": "/assets/engines/w12.png",
        "Advantages":"High Efficiency: Stirling engines can achieve high thermal efficiency, especially when paired with renewable heat sources like solar energy.Low Noise: Since combustion occurs externally, Stirling engines operate quietly compared to internal combustion engines.Versatility: They can use almost any heat source, including solar, nuclear, or waste heat from industrial processes.",
        "Issues":"Slow Response Time: Stirling engines are not well-suited for applications requiring rapid changes in power output, as they take time to adjust to temperature changes.Complexity and Cost: The need for precise engineering to maintain gas seals and manage heat transfer makes Stirling engines expensive to manufacture and maintain.Low Power-to-Weight Ratio: They are generally bulkier and heavier than internal combustion engines, limiting their use in mobile applications."

      },
      {
        "topic": "The Wankel Rotary Engine: A Unique Design",
        "Description": "The Wankel rotary engine, developed by Felix Wankel in the 1950s, is an internal combustion engine that uses a triangular rotor instead of reciprocating pistons. The rotor spins in an epitrochoidal chamber, creating three combustion spaces that undergo intake, compression, combustion, and exhaust cycles in a single rotation. This design allows for smooth and continuous power delivery.",
        "image": "/assets/engines/w12.png",
        "Advantages":"Compact Size: The Wankel engine is smaller and lighter than traditional piston engines, making it ideal for applications where space is limited.High Power-to-Weight Ratio: Its design allows for high power output relative to its size.Smooth Operation: The absence of reciprocating parts reduces vibration and noise.",
        "Issues":"Fuel Efficiency and Emissions: Wankel engines tend to consume more fuel and produce higher emissions compared to piston engines, due to incomplete combustion and sealing challenges.Sealing Problems: Maintaining a tight seal between the rotor and the chamber is difficult, leading to wear and reduced durability over time.Limited Market Adoption: Despite its advantages, the Wankel engine has seen limited use, primarily in niche applications like Mazda’s RX series of sports cars."

      },
      {
        "topic": "Hybrid Engines: Combining the Best of Both Worlds",
        "Description": "Hybrid engines combine an internal combustion engine (ICE) with an electric propulsion system to improve efficiency and reduce emissions. They can operate in multiple modes, including electric-only, engine-only, or a combination of both, depending on driving conditions.",
        "image": "/assets/engines/w12.png",
        "Advantages":"Improved Fuel Efficiency: Hybrids use regenerative braking and electric power to reduce fuel consumption.Reduced Emissions: By relying on electric power for low-speed driving, hybrids produce fewer emissions.Extended Range: The ICE provides backup power, eliminating range anxiety associated with pure electric vehicle",
        "Issues":"Complexity: Hybrid systems are more complex than traditional engines, requiring advanced control systems and software.Higher Cost: The additional components and technology make hybrids more expensive to produce and purchase.Battery Limitations: Like electric vehicles, hybrids rely on batteries, which have environmental and durability concerns."

      }
    ]
    },
    {
      "id": 3,
      "name": "Suspension",
      "image": "/assets/suspension.png",
      "shadow": "/assets/suspensionShadow.png",
      "description": "Suspension systems are responsible for maximizing tire contact with the road surface, absorbing shocks, and providing vehicle stability during cornering and braking.",
      "subTopic1": "Suspension Dynamics",
      "subTopic2": null,
      "subSection": [
        {
          "subName1": null,
          "subImage1": null
        },
        {
          "subName1": null,
          "subImage1": null
        },
        {
          "subName1": null,
          "subImage1": null
        },
        {
          "subName1": null,
          "subImage1": null
        }
      ],
      "partset1": [
        {
          "name": "Shock Absorbers",
          "image": "/assets/suspensionParts/shockAbsobers1.png",
          "description": "Hydraulic or gas-filled dampers that control spring oscillations and maintain tire contact with the road surface."
        },
        {
          "name": "Coil Springs",
          "image": "/assets/suspensionParts/Springs.png",
          "description": "Elastic components that absorb and store kinetic energy from road impacts while supporting vehicle weight."
        },
        {
          "name": "Control Arms",
          "image": "/assets/suspensionParts/controlArms1.png",
          "description": "Pivoting links that connect suspension components to the chassis while allowing vertical wheel movement."
        },
        {
          "name": "Anti-Roll Bar",
          "image": "/assets/suspensionParts/antoRollBar1.png",
          "description": "Torsion bar that reduces body roll during cornering by transferring force between left/right wheels."
        },
        {
          "name": "Knuckle Assembly",
          "image": "/assets/suspensionParts/knuckle_Assemble1.png",
          "description": "Structural hub connecting wheel bearings, brakes, and suspension components while enabling steering rotation."
        },
        {
          "name": "Bushings",
          "image": "/assets/suspensionParts/Springs.png",
          "description": "Vibration-dampening rubber or polyurethane mounts that isolate noise while allowing controlled movement."
        }
      ],
      "variations": [
        {
          "name": "MacPherson Strut",
          "image": "/assets/suspensionParts/variations/macpherson-strut-suspension1.png",
          "sound": "/assets/records/suspensionSound.mp3"
        },
        {
          "name": "Double Wishbone",
          "image": "/assets/suspensionParts/variations/double_wishbone.png",
          "sound": "/assets/records/suspensionSound.mp3"
        },
        {
          "name": "Multi-Link",
          "image": "/assets/suspensionParts/variations/multi-Link1.png",
          "sound": "/assets/records/suspensionSound.mp3"
        },
        {
          "name": "Air Suspension",
          "image": "/assets/suspensionParts/variations/Air_Suspension1.png",
          "sound": "/assets/records/suspensionSound.mp3"
        },
        {
          "name": "Solid Axle",
          "image": "/assets/suspensionParts/variations/solidAxle.png",
          "sound": "/assets/records/suspensionSound.mp3"
        }
      ],
      "maindetailset1": {
        "topic": "The Evolution of Suspension Systems",
        "Description": "From horse-drawn carriage leaf springs to computer-controlled adaptive dampers, suspension technology has undergone radical transformation. Early 20th century vehicles used rigid axles and lever-arm shock absorbers, while modern systems employ precision-engineered kinematics and real-time electronic control. Key milestones include the introduction of independent suspension (1934 Citroën Traction Avant), air suspension (1958 Cadillac Brougham), and adaptive magnetic dampers (2002 Audi TT)."
      },
      "detailset1": [
        {
          "topic": "Leaf Springs to Coil Springs: The First Revolution",
          "Description": "Early automotive suspensions (1890s-1920s) adapted carriage leaf spring designs, providing durability but poor ride quality. The 1934 Citroën Traction Avant introduced torsion bar suspension, while the 1949 Oldsmobile 88 pioneered modern coil spring setups. By the 1960s, coil springs became standard, offering better packaging and progressive spring rates."
        },
        {
          "topic": "Rise of Computer-Controlled Systems",
          "Description": "The 1980s saw the first electronic suspensions with Lotus' active hydropneumatic system. Modern systems like Mercedes MAGIC BODY CONTROL (2013) use stereo cameras to scan road surfaces and adjust damping in milliseconds. Formula 1-inspired technologies like FRIC (Front-Rear Inter-Connected) suspension now trickle down to production cars."
        }
      ],
      "maindetailset2": {
        "topic": "Advanced Suspension Technologies",
        "Description": "Modern suspension systems blend mechanical engineering with cutting-edge electronics to achieve conflicting goals of comfort and performance. From predictive active dampers to hydraulic anti-roll systems, these technologies redefine vehicle dynamics."
      },
      "detailset2": [
        {
          "topic": "Adaptive Air Suspension",
          "Description": "Pneumatic suspension system using rubber-bladder air springs (typically 8-12 psi operating pressure) controlled by ECU-managed compressors. Features continuous height adjustment (±75mm range) and dynamic rate changes through multi-chamber air springs (Mercedes ABC System). Modern versions integrate GPS topography mapping to pre-adjust for inclines (Land Rover Terrain Response 2). Critical components include WABCO-supplied axial piston compressors (flow rate: 180 liters/min) and silicone-impregnated polyurethane bellows rated for 500,000 compression cycles.",
          "image": "/assets/suspension/airSystem.png",
          "Advantages": [
            "• Auto-leveling maintains 0.5° chassis attitude under 1,000kg payload variations",
            "• Speed-sensitive lowering (Audi S8 reduces height 25mm at 120km/h for 3.8% Cd improvement)",
            "• Offroad articulation modes (Range Rover extends travel 115mm with cross-linked dampers)",
            "• Load-compensated stability (Mercedes Sprinter maintains handling with 4,000lb payload)"
          ],
          "Issues": [
            "• Compressor failures in sub -25°C due to moisture freezing (common in Nordic climates)",
            "• $4,200 average repair cost for valve block replacements (dealer-only programming)",
            "• 35% reduced spring rate consistency after 5 years/150k miles (bladder fatigue)",
            "• Limited compatibility with aggressive wheel setups (stretched sidewalls risk pinch flats)"
          ]
        },
        {
          "topic": "Magnetorheological Dampers",
          "Description": "Delphi-developed shock absorbers using iron particle-infused hydrocarbon fluid (20-40% volumetric concentration). When subjected to 12-24V/5A electromagnetic fields (1.2 Tesla max), particles form fibrous structures altering viscosity in 0.002s. Used in Corvette ZR1's Performance Traction Management with 1000Hz adjustment rate. Current gen systems (GM MagneRide 4.0) feature twin-wire coils reducing latency to 0.8ms and power draw to 2.3A.",
          "image": "/assets/suspension/magneRide.png",
          "Advantages": [
            "• 60% reduction in body roll vs passive dampers (Ferrari 488 Pista achieves 1.3g lateral)",
            "• Track mode increases damping force 400% (Lamborghini ALA system integration)",
            "• Fail-safe mineral oil base maintains function during electrical faults",
            "• 0.5mm precision in wheel control (Cadillac CT5-V Blackwing Nürburgring setup)"
          ],
          "Issues": [
            "• $380/liter MR fluid replacement every 50k miles (specialized flushing required)",
            "• 8.5kg weight penalty per corner vs conventional shocks",
            "• Eddy current heating reduces consistency during 25min+ track sessions",
            "• Incompatible with aftermarket lowering springs (piston rod travel limits)"
          ]
        },
        {
          "topic": "Hydraulic Interconnection Systems",
          "Description": "Citroën's Hydractive 3+ system links front/rear suspension via LDS mineral oil (70 bar operating pressure) through 6mm diameter pipelines. Uses 12-way proportional valves to manage fluid flow between 7 hydraulic spheres (4 suspension, 1 accumulator, 2 anti-sink). Advanced versions (DS7 Crossback) employ 14 pressure sensors and AI to predict road inputs 200ms in advance. Provides both 'flying carpet' comfort and 25% roll stiffness increase in Sport mode.",
          "image": "/assets/suspension/hydraulic.png",
          "Advantages": [
            "• Eliminates anti-roll bars saving 11kg unsprung mass",
            "• Progressive roll resistance from 500Nm/° to 2200Nm/° dynamically",
            "• Self-leveling maintains ride height with 0.05mm accuracy under load shifts",
            "• 400W power consumption vs 2kW+ in air suspension systems"
          ],
          "Issues": [
            "• $6,000+ repair costs for pump failures (requires full system bleeding)",
            "• 0.5mm/year pipeline erosion in salt-heavy environments",
            "• 15% efficiency loss after 100k miles due to fluid shear breakdown",
            "• Specialized LDS fluid ($120/liter) incompatible with standard ATF"
          ]
        }
      ]
    },
    {
      "id": 4,
      "name": "Cooler",
      "image": "/assets/cooler.png",
      "shadow": "/assets/coolerShadow.png",
      "description": "Thermal management systems maintain optimal operating temperatures (195-230°F coolant, 180-245°F oil) through precise heat exchange. Modern systems dissipate 500,000+ BTU/hour while maintaining 12-18 psi pressure for efficient boiling point elevation.",
      "subTopic1": null,
      "subTopic2": null,
      "subSection": [
        {
          "subName1": null,
          "subImage1": null,
          "description": null
        }
       
      ],
      "partset1": [
        {
          "name": "Radiator",
          "image": "/assets/cooling system/cooler.png",
          "description": "Aluminum radiators achieve 150 W/m·K conductivity with 0.2mm fin spacing. Nano-surfaced coatings boost thermal rejection by 18% through increased turbulent flow."
        },
        {
          "name": "Cooling Fan",
          "image": "/assets/cooling system/coolingFan.png",
          "description": "Electric or engine-driven fans force air through radiator cores at 1,500-3,000 CFM. PWM-controlled variable speed operation optimizes cooling based on temperature and vehicle speed demands."
        },
        {
          "name": "Hoses",
          "image": "/assets/cooling system/hoses.png",
          "description": "Silicone-reinforced EPDM hoses with 4-ply aramid construction withstand 350°F continuous/500°F peak temperatures. Multi-layer designs resist coolant permeation and electrochemical degradation."
        },
        {
          "name": "Pressure Cap",
          "image": "/assets/cooling system/pressureCap.png",
          "description": "Vacuum-brazed aluminum cores (AA3003 alloy) withstand 500+ thermal cycles. Silicone hoses rated for 350°F continuous/500°F peak temps."
        },
        {
          "name": "Thermostat",
          "image": "/assets/cooling system/Thermostut.png",
          "description": "Centrifugal pumps flow 150-250 gpm against 15psi head pressure. Coolant velocity optimized at 4-8 ft/s through 5mm diameter microtubes."
        },
        {
          "name": "Water Pump",
          "image": "/assets/cooling system/waterPump.png",
          "description": "Vacuum-brazed aluminum cores (AA3003 alloy) withstand 500+ thermal cycles. Silicone hoses rated for 350°F continuous/500°F peak temps."
        }
      ],
      "variations": [
        {
          "name": "Liquid Cooling",
          "image": "/assets/cooling system/coolingSystem.png",
          "sound": "/assets/records/coolerSound.mp3",
          "description": "Circulates 50/50 glycol mixture through engine block at 2.5 GPM flow rate. Maintains optimal 195°F operating temperature (standard automotive applications)."
        },
        {
          "name": "Air Cooling",
          "image": "/assets/cooling system/coolingSystem.png",
          "sound": "/assets/records/coolerSound.mp3",
          "description": "Uses directed airflow across finned surfaces to dissipate heat. Common in motorcycles and classic VW engines, achieving 15-20°F above ambient temperature differentials."
        },
        {
          "name": "Oil Cooling",
          "image": "/assets/cooling system/coolingSystem.png",
          "sound": "/assets/records/coolerSound.mp3",
          "description": "Utilizes engine or transmission oil as primary heat transfer medium. Maintains critical components at 180-230°F with 8-12 liter capacity systems (Porsche 911 air-cooled era)."
        },
        {
          "name": "Hybrid Cooling",
          "image": "/assets/cooling system/coolingSystem.png",
          "sound": "/assets/records/coolerSound.mp3",
          "description": "Combines multiple cooling methods with separate low/high temp circuits for battery/engine cooling. Manages 50kW thermal loads in hybrid vehicles (Toyota THS II)."
        },
        {
          "name": "Phase Change Cooling",
          "image": "/assets/cooling system/coolingSystem.png",
          "sound": "/assets/records/coolerSound.mp3",
          "description": "Exploits latent heat of vaporization for superior thermal transfer. Includes heat pipes, vapor chambers, and cryogenic systems capable of 2000+ W/cm² heat flux management."
        }
      ],

        "maindetailset1": {
          "topic": "Evolution of Automotive Cooling",
          "Description": "From the earliest 1912 thermosiphon systems that moved coolant by natural convection, through the first pressurized cooling innovations by Nash in 1937, to the aluminum radiators pioneered by Jaguar in the 1960s, and on to variable‑flow coolant pumps like BMW’s 2004 N52, automotive cooling has continuously evolved to meet rising thermal demands—now exceeding 800 hp. Along the way, pressures increased to boost boiling points, wax‑pellet thermostats supplanted older bellows types by the late 1930s, and centrifugal water pumps became commonplace. Today’s labs explore magnetocaloric pumps and graphene‑enhanced nanofluids for next‑generation thermal management."
        },
        "detailset1": [
          {
            "topic": "Early Cooling Solutions",
            "Description": "Timeline: 1909 – After the first ~2,500 units, Ford dropped the gear‑driven water pump, moving to a passive thermosiphon cooling system for the Model T. 1910–1927 – That thermosiphon circuit became standard, conveying about 1.5 gpm of coolant through heavy brass‑copper radiators (~0.5 m² surface, 85 lbs). 1927 – A brief water pump reappeared mid‑production, but the thermosiphon setup remained dominant until the car’s end. The system exemplified simplicity and reliability: a 4‑gallon loop that relied solely on natural convection, though it struggled under high loads. Over subsequent decades, advances led to vacuum‑brazed aluminum cores delivering 3 m² of surface area in just 15 lbs—cutting weight by ~82% while vastly improving heat rejection."
          },
          {
            "topic": "Turbocharging Revolution",
            "Description": "Timeline: 1978 – Saab launched the 99 Turbo and early 900 Turbo with oil‑cooled Garrett T3 turbos. 1982 – Introduction of Automatic Performance Control (APC) enabled safer high‑boost operation, though turbo cooling remained oil‑based. 1988 – Saab added water‑cooled Garrett T3 turbos in U.S. 900 Turbo models, enhancing durability. 1990–1991 – SPG models received smaller water‑cooled Mitsubishi TE‑05 turbos, offering quicker spool; this became standard across all 900 Turbos by 1991. Today – Electric turbos in vehicles like the Audi SQ7 use dedicated 48 V coolant circuits to keep 150,000 RPM bearings below 250 °F. Saab’s move to water cooling in 1988 marked a key industry milestone by shifting turbo cooling from oil to liquid, laying groundwork for modern thermal strategies in forced‑induction systems."
          }
        ],
        "maindetailset2": {
          "topic": "Advanced Cooling Technologies",
          "Description": "Today’s research in automotive thermal management pushes into active, predictive realms. Technologies like phase‑change thermal storage and smart thermal networks are being paired with AI‑driven predictive control systems. An example: GM’s Active Thermal Control system uses over 25 sensors (measuring engine load, GPS, traffic, even ambient conditions) to anticipate thermal peaks and proactively direct coolant flow—optimizing efficiency and response."
        },
        "detailset2": [
          {
            "topic": "Electro‑Viscous Coolant",
            "Description": "This next‑gen coolant—based on 3M’s Fluorinert—adjusts viscosity electrically, ranging from near water to syrup‑like (0–50,000 cP). This on‑demand behavior replaces mechanical valves, offering up to 90% faster thermal response than conventional thermostats. Without mechanical control devices, it also reduces parasitic losses from water pumps and self‑bleeds micro‑bubbles. However, these fluids cost around $300 per gallon, require a 200 V electrical system, and polymer components degrade above 150 °C."
          },
          {
            "topic": "Additive‑Manufactured Cores",
            "Description": "Using 3D‑printed titanium with gyroid‑lattice cores, these radiators offer 130% more surface area per volume than aluminium, yet weigh 50% less. They boast burst pressure ratings to 35 psi, integrated oil‑water passages for multifunctional cooling, and can be optimized aerodynamically to fit vehicle contours. But manufacturing costs currently exceed $8,000 per unit, repairs are nearly impossible, and gaining road‑use certifications remains a complex challenge."
          },
          {
            "topic": "Solar Loading Compensation",
            "Description": "Coolants like BASF’s Glysantin S3 feature infrared‑reflective properties and low‑emissivity (~0.2) coatings to reject radiant heat—reducing cabin soak temperatures by as much as 25 °F. This cuts A/C demand by roughly 15%, prevents vapor‑lock under extreme heat, and uses UV‑resistant polymer tanks. Drawbacks include a $75 “premium” per gallon, special disposal needs, and incompatibility with traditional brass cooling system parts."
          }
        ]


    },
    {
      "id": 5,
      "name": "Brake",
      "image": "/assets/brake.png",
      "shadow": "/assets/brakeShadow.png",
      "description": "The Brake Control Unit (BCU) is responsible for managing the vehicle's braking system, ensuring optimal performance and safety. It processes data from various sensors to control brake force distribution, monitor system health, and enhance driver feedback. Modern BCUs often integrate advanced features like anti-lock braking (ABS) and electronic stability control (ESC).",
      "subTopic1" : null,
      "subTopic2" : null,
      "subSection": [
       {
       "subName1": null,
       "subImage1": null
        }

          ],
        "partset1": [
        {
          "name": "Brake Caliper",
          "image": "/assets/BrakeSystem/brake.png",
          "description": "Holds the brake pads and applies pressure to them when the brake is engaged."
        },
        {
          "name": "Brake Pads",
          "image": "/assets/BrakeSystem/brakePadel1.png",
          "description": "Friction materials that press against the brake disc to slow down or stop the vehicle."
        },
        {
          "name": "Brake Shoes",
          "image": "/assets/BrakeSystem/brake_shoes.png",
          "description": "Holds the brake pads and applies pressure to them when the brake is engaged."
        },
        {
          "name": "Brake Lines",
          "image": "/assets/BrakeSystem/brake_lines1.png",
          "description": "Hoses that carry brake fluid from the master cylinder to the brake calipers."
        },
                {
          "name": "ABS Module",
          "image": "/assets/BrakeSystem/abs_Module1.png",
          "description": "Controls the anti-lock braking system to prevent wheel lockup during braking."
        },
        {
          "name": "Brake Master Cylinder",
          "image": "/assets/BrakeSystem/brake_master_cylinder1.png",
          "description": "Houses the brake fluid reservoir and generates hydraulic pressure for the braking system."
        }
      ],
          "maindetailset1": {
            "topic": "The Evolution of Brake System",
            "Description": "A timeline of key milestones in the development of automotive braking systems, from early mechanical setups to sophisticated modern technologies."
          },
          "detailset1": [
            {
              "topic": "1886 – External Contracting Mechanical Brakes",
              "Description": "Karl Benz’s Patent-Motorwagen used external contracting wooden block brakes acting on the rear wheels via mechanical linkages. :contentReference[oaicite:1]{index=1}"
            },
            {
              "topic": "1899–1902 – Drum Brake Emerges",
              "Description": "Wilhelm Maybach implemented early cable-actuated drum brakes in 1899; Louis Renault patented the modern internal-expanding drum brake in 1902. :contentReference[oaicite:2]{index=2}"
            },
            {
              "topic": "1902 – First Disc Brake Patent",
              "Description": "Frederick W. Lanchester patented a disc brake in Birmingham—an early precursor to modern disc systems, though broad adoption came much later. :contentReference[oaicite:3]{index=3}"
            },
            {
              "topic": "1915–1921 – Four-Wheel Mechanical & Hydraulic Drums",
              "Description": "Duesenberg employed four-wheel mechanical brakes by 1915 (e.g., at Elgin Race); Malcolm Loughead (Lockheed) patented 1918 hydraulic drums, leading to the 1921 Model A Duesenberg's mass-market hydraulic braking. :contentReference[oaicite:4]{index=4}"
            },
            {
              "topic": "1928 – Vacuum‑Assisted Power Brakes",
              "Description": "Pierce‑Arrow introduced the first production vacuum brake booster, using intake-manifold vacuum to significantly reduce pedal effort. :contentReference[oaicite:5]{index=5}"
            },
            {
              "topic": "1946–1950 – Self‑Adjusting Drums & Return of Disc",
              "Description": "Studebaker introduced self‑adjusting drum brakes in 1946; Chrysler offered early disc‑drum hybrid systems by 1949. :contentReference[oaicite:6]{index=6}"
            },
            {
              "topic": "1952–1958 – Modern Disc Brakes & Racing Debut",
              "Description": "Jaguar C‑Type used disc brakes in 1952; Citroën DS popularized them in 1955; Jensen FF added ABS-derived Maxaret in 1958. :contentReference[oaicite:7]{index=7}"
            },
            {
              "topic": "1960s–1970s – Electronic ABS Arrives",
              "Description": "Dunlop’s Maxaret mechanical ABS appeared on cars in early 1960s; electronic ABS debuted in 1978 Mercedes‑Benz S-Class. :contentReference[oaicite:8]{index=8}"
            },
            {
              "topic": "1990s – Electronic Brake‑Force Distribution (EBD)",
              "Description": "EBD emerged in the 1990s as an ABS-linked system adjusting brake pressure per wheel for optimal stability and load adaptation. :contentReference[oaicite:9]{index=9}"
            },
            {
              "topic": "2001 – Brake‑by‑Wire (ECB)",
              "Description": "Toyota introduced the first production brake‑by‑wire with its Electronically Controlled Brake (ECB) system on the 2001 Estima Hybrid and 2005 Lexus RX 400h. :contentReference[oaicite:10]{index=10}"
            },
            {
              "topic": "2000s–Present – EPB, ESC & Regenerative Braking",
              "Description": "Electronic Parking Brakes, full vehicle Electronic Stability Control, and regenerative braking in EVs/Hybrids debuted—completing today’s advanced brake systems. :contentReference[oaicite:11]{index=11}"
            }
          ],
          "maindetailset2": {
            "topic": "Advanced Brake Technologies",
            "Description": "Modern vehicles integrate electronic systems—ABS, EBD, ESC, brake‑by‑wire and EPB—to boost braking safety, control, and performance under diverse driving conditions."
          },
          "detailset2": [
            {
              "topic": "ABS Hydraulic Control Unit (HCU)",
              "Description": "Contains pump, accumulator, solenoid valves, and hydraulic passages. Responds to ABS ECU signals to hold/release/reapply pressure, preventing wheel lock-up at speeds up to ~15 cycles per second. :contentReference[oaicite:11]{index=11}"
            },
            {
              "topic": "Electronic Brake‑force Distribution (EBD)",
              "Description": "Automatically varies brake pressure per wheel based on load and traction. Works via ABS system to optimize stopping and stability; step beyond fixed proportioning valves. :contentReference[oaicite:12]{index=12}"
            },
            {
              "topic": "Electronic Stability Control (ESC)",
              "Description": "Utilizes ABS hardware plus yaw and steering sensors to brake individual wheels and counter under/oversteer, enhancing directional control during maneuvers. :contentReference[oaicite:13]{index=13}"
            },
            {
              "topic": "Brake‑by‑Wire / Electro‑Hydraulic Systems",
              "Description": "Electronically links pedal input to actuators via sensors and control units instead of direct hydraulic lines. Features in EVs/Hybrids and heavy vehicles (EBS), offering precise control and redundancy. :contentReference[oaicite:14]{index=14}"
            }
          ]
    },
    {
      "id": 6,
      "name": "ECU",
      "image": "/assets/ecu.png",
      "shadow": "/assets/ecuShadow.png",
      "description": "The Engine Control Unit (ECU) is the brain of the engine, managing various functions such as fuel injection, ignition timing, and emissions control. It uses data from various sensors to optimize engine performance, efficiency, and reliability. Modern ECUs are highly sophisticated, often featuring adaptive learning algorithms that adjust parameters in real-time based on driving conditions and driver behavior.",
      "subTopic1" : null,
      "subTopic2" : null,
      "subSection": [
       {
       "subName1": null,
       "subImage1": null
        }

          ],
      "partset1": [
          {
            "name": "Microcontroller",
            "image": "/assets/ECUParts/microController.png",
            "description": "The microcontroller is the central processing unit of the ECU, executing control algorithms and processing sensor data."
          },
          {
            "name": "Sensor Interface",
            "image": "/assets/ECUParts/SensorInterface.png",
            "description": "The sensor interface collects data from various engine sensors, providing crucial information to the ECU for optimal performance."
          },
          {
            "name": "Actuator Drivers",
            "image": "/assets/ECUParts/ActuvatorDrivers.png",
            "description": "Actuator drivers control the movement of various engine components, ensuring precise operation and response to driver inputs."
          },
          {
            "name": "Memory Units",
            "image": "/assets/ECUParts/microController.png",
            "description": "Memory units store data and instructions for the ECU, enabling it to make real-time decisions based on sensor inputs."
          }
        ],
      "maindetailset1": {
        "topic": "The Evolution of ECUs",
        "Description": "An Electronic Control Unit (ECU), often called an Engine Control Module (ECM), is essentially a small embedded computer that manages a vehicle’s subsystems—most notably fuel injection, ignition timing, idle speed, emissions, and increasingly, drivetrain and safety systems.It processes inputs from sensors, runs control algorithms, and sends commands to actuators"
      },
      "detailset1": [
        {
          "topic": "1939 – Mechanical-Hydraulic Beginnings",
          "Description": "BMW’s Kommandogerät was introduced in 1939 on the BMW 801 aircraft engine, most notably in the Fw 190. It centralized multiple engine controls—fuel flow, ignition timing, supercharger settings, propeller pitch—into a single throttle lever. As an electro‑hydraulic “control unit,” it is often considered the first ancestor of modern ECUs."
        },
        {
          "topic": "1957–1967 – Analog EFI Emerge",
          "Description": "The Bendix Electrojector debuted in 1957 as the first electronic fuel-injection (EFI) system for passenger cars (AMC, Chrysler). It used transistors and vacuum sensors for pulse-width fuel control but was marred by cold-start issues and underhood fragility.Bosch later acquired patents and in 1967 launched D‑Jetronic, an analog EFI system using manifold pressure sensors and about 25 transistors for closed-loop fuel control in vehicles like VW, Mercedes, Porsche, and Jaguar"
        },
        {
          "topic": "1975–1979 – Dawn of Microprocessor ECUs",
          "Description": "The shift to digital began with Ford’s EEC I in 1975, powered by a Toshiba TLCS-12 microprocessor and marking the first mass-market ECU implementation.Just four years later, Bosch’s Motronic 1.0 arrived on the 1979 BMW 7‑Series, integrating fuel and ignition controls in a digital unit based on a Siemens 8051 platform"
        },
        {
          "topic": "1980s – Digital Diagnostics & System Integration",
          "Description": "The 1980s brought digital maturity and onboard diagnostics. GM’s Delco units introduced closed-loop carburetor control, while VW’s Digifant in 1986 merged fuel injection with ignition, adding knock control and idle stability."
        },
        {
          "topic": "1989–1990s – Modular ECUs & Standardized Diagnostics",
          "Description": "Rover’s MEMS in 1989 featured a Motorola 8096 microcontroller and modular design for expanded functionality.The 1990s saw digital ECUs controlling diesel engines, transmissions, ABS, and body electronics, culminating in OBD-II standards that significantly advanced diagnostics and monitoring."
        },
         {
          "topic": "2000s – Networked Control & Emissions Management",
          "Description": "In the 2000s, drive-by-wire throttles, EGR, DPF, turbo management, and hybrid functions were centralized under ECUs networked via high-speed CAN bus systems. Advanced sensor integration, like MAF replacing MAP sensors, became widespread, and direct injection systems began appearing."
        },
        {
          "topic": "2010s–2025 – Centralized AI-Driven ECUs",
          "Description": "Contemporary vehicles feature domain controllers, each overseeing powertrain, chassis, luxury, ADAS, EV, and battery systems, often communicating via CAN-FD and automotive Ethernet . ECUs now manage tens of thousands of calibration parameters and support AI-driven adaptive tuning and predictive maintenance. Diagnostics have moved to UDS/DCM standards, with cybersecurity and OTA software updates becoming essential."
        }
      ],
      "maindetailset2": {
        "topic": "ECU Types in Modern Vehicles",
        "Description": "An Electronic Control Unit (ECU) is an embedded system that controls one or more of the electrical systems or subsystems in a vehicle. Modern vehicles contain 30 to over 100 ECUs, each managing different aspects of operation—ranging from engine performance to climate control, safety, infotainment, and advanced driver assistance systems (ADAS). ECUs have become essential to achieving efficiency, safety, automation, and connectivity in automobiles.."
      },
      "detailset2": [
        {
          "topic": "Engine Control Module (ECM / Engine ECU)",
          "Description": "The ECM is the powerhouse of engine performance control. By continuously monitoring sensors like crankshaft or cam position, oxygen, mass airflow, manifold pressure, and knock detectors, it calculates the optimal fuel injection timing, ignition angle, and idle control to maximize power, efficiency, and emissions compliance. It also manages auxiliary systems like variable valve timing, turbocharging, exhaust gas recirculation (EGR), cooling fans, and even thermal protection during cold starts or engine warm-up. All control decisions are based on digital maps and algorithms stored in its memory, replacing older mechanical fuel metering systems .",
          "image": "/assets/ecu.png",
          "Advantages": null,
          "Issues": null
             },
        {
          "topic": "Transmission Control Unit (TCU / TCM)",
          "Description": "The TCU manages gear shifting in automatic, CVT, dual-clutch, and semi-automatic transmissions. Using inputs such as similar engine data plus vehicle and turbine speeds, gear position, throttle input, and transmission fluid temperature, it executes shift logic via solenoids that engage clutches and control torque converter lock-up . By adapting shift timing to driving style or mode (e.g., Sport or Eco), the TCU improves power delivery, fuel efficiency, and shift smoothness — outweighing mechanical linkage systems from earlier erase.",
          "image": "/assets/ecu.png",
          "Advantages": null,
          "Issues": null
                },
        {
          "topic": "Climate Control ECU (HVAC Module)",
          "Description": "The Climate Control ECU manages the heating, ventilation, and air conditioning (HVAC) systems in a vehicle. It ensures passenger comfort by regulating temperature, humidity, and air quality. The ECU uses data from various sensors, such as cabin temperature, outside temperature, and solar radiation, to optimize HVAC performance. Advanced systems may also integrate with navigation data to precondition the cabin based on route and traffic conditions.",
          "image": "/assets/ecu.png",
          "Advantages": null,
          "Issues": null
        }
      ]
    }
  ]
  




  